Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: Check the database server performance or tweak its configuration, for example using `PGTune <https://pgtune.leopard.in.ua/>`_.
sv: Kontrollera databasserverns prestanda eller justera dess konfiguration, till exempel med hjÃ¤lp av `PGTune <https://pgtune.leopard.in.ua/>`_.

source: Configure cache
sv: Konfigurera cache

source: If possible, use Valkey or Redis from Django by adjusting the ``CACHES`` configuration variable, for example:
sv: Om mÃ¶jligt, anvÃ¤nd Valkey eller Redis frÃ¥n Django genom att justera konfigurationsvariabeln ``CACHES``, till exempel:

source: In case you change settings for the cache, you might need to adjust them for Celery as well, see :ref:`celery`.
sv: Om du Ã¤ndrar instÃ¤llningarna fÃ¶r cachen kan du behÃ¶va justera dem Ã¤ven fÃ¶r Celery, se :ref:`celery`.

source: Avatar caching
sv: Avatar-cachning

source: In addition to caching of Django, Weblate performs caching of avatars. It is recommended to use a separate, file-backed cache for this purpose:
sv: FÃ¶rutom caching av Django utfÃ¶r Weblate Ã¤ven caching av avatarer. Det rekommenderas att anvÃ¤nda en separat, filbaserad cache fÃ¶r detta Ã¤ndamÃ¥l:

source: Configure e-mail sending
sv: Konfigurera e-postutskick

source: Weblate needs to send out e-mails on several occasions, and these e-mails should have a correct sender address, please configure :setting:`SERVER_EMAIL` and :setting:`DEFAULT_FROM_EMAIL` to match your environment, for example:
sv: Weblate behÃ¶ver skicka e-postmeddelanden vid flera tillfÃ¤llen, och dessa e-postmeddelanden ska ha en korrekt avsÃ¤ndaradress. Konfigurera :setting:`SERVER_EMAIL` och :setting:`DEFAULT_FROM_EMAIL` sÃ¥ att de passar din miljÃ¶, till exempel:

source: To disable sending e-mails by Weblate set :setting:`django:EMAIL_BACKEND` to ``django.core.mail.backends.dummy.EmailBackend``.
sv: FÃ¶r att inaktivera e-postutskick via Weblate, stÃ¤ll in :setting:`django:EMAIL_BACKEND` till ``django.core.mail.backends.dummy.EmailBackend``.

source: This will disable *all* e-mail delivery including registration or password reset e-mails.
sv: Detta kommer att inaktivera *alla* e-postleveranser, inklusive registrerings- eller lÃ¶senordsÃ¥terstÃ¤llningsmeddelanden.

source: Allowed hosts setup
sv: TillÃ¥tna vÃ¤rdar instÃ¤llning

source: Django requires :setting:`ALLOWED_HOSTS` to hold a list of domain names your site is allowed to serve, leaving it empty will block any requests.
sv: Django krÃ¤ver att :setting:`ALLOWED_HOSTS` innehÃ¥ller en lista Ã¶ver domÃ¤nnamn som din webbplats fÃ¥r betjÃ¤na. Om du lÃ¤mnar den tom kommer alla fÃ¶rfrÃ¥gningar att blockeras.

source: In case this is not configured to match your HTTP server, you will get errors like :samp:`Invalid HTTP_HOST header: '1.1.1.1'. You may need to add '1.1.1.1' to ALLOWED_HOSTS.`
sv: Om detta inte Ã¤r konfigurerat fÃ¶r att matcha din HTTP-server kommer du att fÃ¥ felmeddelanden som :samp:`Ogiltig HTTP_HOST-rubrik: '1.1.1.1'. Du kan behÃ¶va lÃ¤gga till '1.1.1.1' till ALLOWED_HOSTS.`

source: On Docker container, this is available as :envvar:`WEBLATE_ALLOWED_HOSTS`.
sv: PÃ¥ Docker-containern Ã¤r detta tillgÃ¤ngligt som :envvar:`WEBLATE_ALLOWED_HOSTS`.

source: Django secret key
sv: Djangos hemliga nyckel

source: The :setting:`SECRET_KEY` setting is used by Django to sign cookies, and you should really generate your own value rather than using the one from the example setup.
sv: InstÃ¤llningen :setting:`SECRET_KEY` anvÃ¤nds av Django fÃ¶r att signera cookies, och du bÃ¶r verkligen generera ditt eget vÃ¤rde istÃ¤llet fÃ¶r att anvÃ¤nda det frÃ¥n exempelkonfigurationen.

source: You can generate a new key using :program:`weblate-generate-secret-key` shipped with Weblate.
sv: Du kan generera en ny nyckel med hjÃ¤lp av :program:`weblate-generate-secret-key` som medfÃ¶ljer Weblate.

source: Running maintenance tasks
sv: KÃ¶r underhÃ¥llsuppgifter

source: For optimal performance, it is good idea to run some maintenance tasks in the background. This is automatically done by :ref:`celery` and covers following tasks:
sv: FÃ¶r optimal prestanda Ã¤r det en bra idÃ© att kÃ¶ra vissa underhÃ¥llsuppgifter i bakgrunden. Detta gÃ¶rs automatiskt av :ref:`celery` och omfattar fÃ¶ljande uppgifter:

source: Configuration health check (hourly).
sv: KonfigurationshÃ¤lsokontroll (varje timme).

source: Committing pending changes (hourly), see :ref:`lazy-commit` and :wladmin:`commit_pending`.
sv: BekrÃ¤fta vÃ¤ntande Ã¤ndringar (varje timme), se :ref:`lazy-commit` och :wladmin:`commit_pending`.

source: Updating component alerts (daily).
sv: Uppdatering av komponentvarningar (dagligen).

source: Update remote branches (nightly), see :setting:`AUTO_UPDATE`.
sv: Uppdatera fjÃ¤rrgrenar (varje natt), se :setting:`AUTO_UPDATE`.

source: Translation memory backup to JSON (daily), see :wladmin:`dump_memory`.
sv: SÃ¤kerhetskopiering av Ã¶versÃ¤ttningsminne till JSON (dagligen), se :wladmin:`dump_memory`.

source: Fulltext and database maintenance tasks (daily and weekly tasks), see :wladmin:`cleanuptrans`.
sv: Fulltext- och databasunderhÃ¥llsuppgifter (dagliga och veckovisa uppgifter), se :wladmin:`cleanuptrans`.

source: System locales and encoding
sv: Systemets lokaliseringar och kodning

source: The system locales should be configured to UTF-8 capable ones. On most Linux distributions this is the default setting. In case it is not the case on your system, please change locales to UTF-8 variant.
sv: Systemets lokaliseringar bÃ¶r konfigureras till UTF-8-kompatibla. PÃ¥ de flesta Linux-distributioner Ã¤r detta standardinstÃ¤llningen. Om sÃ¥ inte Ã¤r fallet pÃ¥ ditt system, Ã¤ndra lokaliseringarna till UTF-8-varianten.

source: For example by editing :file:`/etc/default/locale` and setting there ``LANG="C.UTF-8"``.
sv: Till exempel genom att redigera :file:`/etc/default/locale` och stÃ¤lla in ``LANG="C.UTF-8"`` dÃ¤r.

source: In some cases the individual services have separate configuration for locales. This varies between distribution and web servers, so check documentation of your web server packages for that.
sv: I vissa fall har enskilda tjÃ¤nster separata instÃ¤llningar fÃ¶r lokalisering. Detta varierar mellan distributioner och webbservrar, sÃ¥ kontrollera dokumentationen fÃ¶r dina webbserverpaket fÃ¶r mer information.

source: Apache on Ubuntu uses :file:`/etc/apache2/envvars`:
sv: Apache pÃ¥ Ubuntu anvÃ¤nder :file:`/etc/apache2/envvars`:

source: Apache on CentOS uses :file:`/etc/sysconfig/httpd` (or :file:`/opt/rh/httpd24/root/etc/sysconfig/httpd`):
sv: Apache pÃ¥ CentOS anvÃ¤nder :file:`/etc/sysconfig/httpd` (eller :file:`/opt/rh/httpd24/root/etc/sysconfig/httpd`):

source: Using custom certificate authority
sv: AnvÃ¤nda anpassad certifikatutfÃ¤rdare

source: Weblate does verify SSL certificates during HTTP requests. In case you are using custom certificate authority which is not trusted in default bundles, you will have to add its certificate as trusted.
sv: Weblate verifierar SSL-certifikat under HTTP-fÃ¶rfrÃ¥gningar. Om du anvÃ¤nder en anpassad certifikatutfÃ¤rdare som inte Ã¤r betrodd i standardpaket mÃ¥ste du lÃ¤gga till dess certifikat som betrott.

source: The preferred approach is to do this at system level, please check your distro documentation for more details (for example on debian this can be done by placing the CA certificate into :file:`/usr/local/share/ca-certificates/` and running :command:`update-ca-certificates`).
sv: Det bÃ¤sta sÃ¤ttet Ã¤r att gÃ¶ra detta pÃ¥ systemnivÃ¥. Se dokumentationen fÃ¶r din distribution fÃ¶r mer information (i Debian kan detta till exempel gÃ¶ras genom att placera CA-certifikatet i :file:`/usr/local/share/ca-certificates/` och kÃ¶ra :command:`update-ca-certificates`).

source: The Weblate container does not include it in the search path, you need to specify full path to execute it. For example:
sv: Weblate-containern inkluderar inte den i sÃ¶kvÃ¤gen, du mÃ¥ste ange hela sÃ¶kvÃ¤gen fÃ¶r att kÃ¶ra den. Till exempel:

source: Once this is done, system tools will trust the certificate and this includes Git.
sv: NÃ¤r detta Ã¤r gjort kommer systemverktygen att lita pÃ¥ certifikatet, inklusive Git.

source: For Python code, you will need to configure requests to use system CA bundle instead of the one shipped with it. This can be achieved by placing following snippet to :file:`settings.py` (the path is Debian specific):
sv: FÃ¶r Python-kod mÃ¥ste du konfigurera fÃ¶rfrÃ¥gningar sÃ¥ att de anvÃ¤nder systemets CA-paket istÃ¤llet fÃ¶r det som medfÃ¶ljer. Detta kan gÃ¶ras genom att placera fÃ¶ljande kodsnutt i :file:`settings.py` (sÃ¶kvÃ¤gen Ã¤r Debian-specifik):

source: Compressing client assets
sv: Komprimering av klientresurser

source: Weblate comes with a bunch of JavaScript and CSS files. For performance reasons it is good to compress them before sending to a client. In default configuration this is done on the fly at cost of little overhead. On big installations, it is recommended to enable offline compression mode. This needs to be done in the configuration and the compression has to be triggered on every Weblate upgrade.
sv: Weblate levereras med en rad JavaScript- och CSS-filer. Av prestandaskÃ¤l Ã¤r det bra att komprimera dem innan de skickas till en klient. I standardkonfigurationen gÃ¶rs detta direkt med en liten extra kostnad. Vid stora installationer rekommenderas det att aktivera offlinekomprimeringslÃ¤get. Detta mÃ¥ste gÃ¶ras i konfigurationen och komprimeringen mÃ¥ste aktiveras vid varje uppgradering av Weblate.

source: The configuration switch is simple by enabling :attr:`compressor:django.conf.settings.COMPRESS_OFFLINE` and configuring :attr:`compressor:django.conf.settings.COMPRESS_OFFLINE_CONTEXT` (the latter is already included in the example configuration):
sv: Konfigurationsomkopplaren Ã¤r enkel genom att aktivera :attr:`compressor:django.conf.settings.COMPRESS_OFFLINE` och konfigurera :attr:`compressor:django.conf.settings.COMPRESS_OFFLINE_CONTEXT` (det senare ingÃ¥r redan i exempelkonfigurationen):

source: On each deploy you need to compress the files to match current version:
sv: Vid varje distribution mÃ¥ste du komprimera filerna sÃ¥ att de matchar den aktuella versionen:

source: The official Docker image has this feature already enabled.
sv: Den officiella Docker-bilden har redan denna funktion aktiverad.

source: Running server
sv: KÃ¶rande server

source: In case you are not experienced with services described below, you might want to try :doc:`install/docker`.
sv: Om du inte har erfarenhet av tjÃ¤nsterna som beskrivs nedan kan du prova :doc:`install/docker`.

source: You will need several services to run Weblate, the recommended setup consists of:
sv: Du behÃ¶ver flera tjÃ¤nster fÃ¶r att kÃ¶ra Weblate. Den rekommenderade konfigurationen bestÃ¥r av:

source: Database server (see :ref:`database-setup`)
sv: Databasserver (se :ref:`database-setup`)

source: Cache server (see :ref:`production-cache`)
sv: Cache-server (se :ref:`production-cache`)

source: Frontend web server for static files and SSL termination (see :ref:`static-files`)
sv: Frontend-webbserver fÃ¶r statiska filer och SSL-avslutning (se :ref:`static-files`)

source: WSGI server for dynamic content (see :ref:`uwsgi`)
sv: WSGI-server fÃ¶r dynamiskt innehÃ¥ll (se :ref:`uwsgi`)

source: Celery for executing background tasks (see :ref:`celery`)
sv: Celery fÃ¶r att utfÃ¶ra bakgrundsuppgifter (se :ref:`celery`)

source: There are some dependencies between the services, for example cache and database should be running when starting up Celery or uwsgi processes.
sv: Det finns vissa beroenden mellan tjÃ¤nsterna, till exempel bÃ¶r cache och databas vara igÃ¥ng nÃ¤r Celery- eller uwsgi-processer startas.

source: In most cases, you will run all services on single (virtual) server, but in case your installation is heavy loaded, you can split up the services. The only limitation on this is that Celery and Wsgi servers need access to :setting:`DATA_DIR`.
sv: I de flesta fall kommer du att kÃ¶ra alla tjÃ¤nster pÃ¥ en enda (virtuell) server, men om din installation Ã¤r tungt belastad kan du dela upp tjÃ¤nsterna. Den enda begrÃ¤nsningen fÃ¶r detta Ã¤r att Celery- och Wsgi-servrarna behÃ¶ver Ã¥tkomst till :setting:`DATA_DIR`.

source: The WSGI process has to be executed under the same user the Celery process, otherwise files in the :setting:`DATA_DIR` will be stored with mixed ownership, leading to runtime issues.
sv: WSGI-processen mÃ¥ste kÃ¶ras under samma anvÃ¤ndare som Celery-processen, annars kommer filer i :setting:`DATA_DIR` att lagras med blandad Ã¤ganderÃ¤tt, vilket leder till problem vid kÃ¶rning.

source: See also :ref:`file-permissions` and :ref:`celery`.
sv: Se Ã¤ven :ref:`file-permissions` och :ref:`celery`.

source: Running web server
sv: KÃ¶rande webbserver

source: Running Weblate is not different from running any other Django based program. Django is usually executed as WSGI or fcgi (see examples for different webservers below).
sv: Att kÃ¶ra Weblate skiljer sig inte frÃ¥n att kÃ¶ra nÃ¥got annat Django-baserat program. Django kÃ¶rs vanligtvis som WSGI eller fcgi (se exempel fÃ¶r olika webbservrar nedan).

source: For testing purposes, you can use the built-in web server in Django:
sv: FÃ¶r testÃ¤ndamÃ¥l kan du anvÃ¤nda den inbyggda webbservern i Django:

source: DO NOT USE THIS SERVER IN A PRODUCTION SETTING. It has not gone through security audits or performance tests. See also Django documentation on :djadmin:`django:runserver`.
sv: ANVÃND INTE DENNA SERVER I EN PRODUKTIONSMILJÃ. Den har inte genomgÃ¥tt sÃ¤kerhetsgranskningar eller prestandatester. Se Ã¤ven Django-dokumentationen om :djadmin:`django:runserver`.

source: The Django built-in server serves static files only with :setting:`DEBUG` enabled as it is intended for development only. For production use, please see WSGI setups:
sv: Djangos inbyggda server hanterar endast statiska filer med :setting:`DEBUG` aktiverat, eftersom den endast Ã¤r avsedd fÃ¶r utveckling. FÃ¶r produktionsanvÃ¤ndning, se WSGI-instÃ¤llningar:

source: Serving static files
sv: Servering av statiska filer

source: :file:`/media/` is no longer used for serving screenshots.
sv: :file:`/media/` anvÃ¤nds inte lÃ¤ngre fÃ¶r att visa skÃ¤rmdumpar.

source: Django needs to collect its static files in a single directory. To do so, execute :samp:`weblate collectstatic --noinput`. This will copy the static files into a directory specified by the :setting:`django:STATIC_ROOT` setting (this defaults to a ``static`` directory inside :setting:`CACHE_DIR`).
sv: Django mÃ¥ste samla sina statiska filer i en enda katalog. FÃ¶r att gÃ¶ra detta, kÃ¶r :samp:`weblate collectstatic --noinput`. Detta kopierar de statiska filerna till en katalog som anges av instÃ¤llningen :setting:`django:STATIC_ROOT` (standard Ã¤r en katalog med namnet ``static`` i :setting:`CACHE_DIR`).

source: It is recommended to serve static files directly from your web server, you should use that for the following paths:
sv: Det rekommenderas att servera statiska filer direkt frÃ¥n din webbserver. Du bÃ¶r anvÃ¤nda detta fÃ¶r fÃ¶ljande sÃ¶kvÃ¤gar:

source: Serves static files for Weblate and the admin interface (from defined by :setting:`django:STATIC_ROOT`).
sv: Serverar statiska filer fÃ¶r Weblate och administratÃ¶rsgrÃ¤nssnittet (frÃ¥n definierat av :setting:`django:STATIC_ROOT`).

source: Should be rewritten to rewrite a rule to serve :file:`/static/favicon.ico`.
sv: BÃ¶r skrivas om fÃ¶r att skriva om en regel fÃ¶r att betjÃ¤na :file:`/static/favicon.ico`.

source: Content security policy
sv: InnehÃ¥llssÃ¤kerhetspolicy

source: The default Weblate configuration enables ``weblate.middleware.SecurityMiddleware`` middleware which sets security related HTTP headers like :http:header:`Content-Security-Policy` or :http:header:`X-XSS-Protection`. These are by default set up to work with Weblate and its configuration, but this might need customization for your environment.
sv: Standardkonfigurationen fÃ¶r Weblate aktiverar mellanprogrammet ``weblate.middleware.SecurityMiddleware``, som stÃ¤ller in sÃ¤kerhetsrelaterade HTTP-rubriker som :http:header:`Content-Security-Policy` eller :http:header:`X-XSS-Protection`. Dessa Ã¤r som standard instÃ¤llda fÃ¶r att fungera med Weblate och dess konfiguration, men kan behÃ¶va anpassas fÃ¶r din miljÃ¶.

source: Sample configuration for NGINX and Granian
sv: Exempel pÃ¥ konfiguration fÃ¶r NGINX och Granian

source: The following configuration runs Weblate using Granian the NGINX webserver:
sv: FÃ¶ljande konfiguration kÃ¶r Weblate med Granian NGINX-webbserver:

source: weblate/examples/weblate.nginx.granian.conf
sv: weblate/exempel/weblate.nginx.granian.conf

source: Sample configuration for NGINX and Gunicorn
sv: Exempel pÃ¥ konfiguration fÃ¶r NGINX och Gunicorn

source: The following configuration runs Weblate using Gunicorn under the NGINX webserver (also available as :file:`weblate/examples/weblate.nginx.gunicorn.conf`):
sv: FÃ¶ljande konfiguration kÃ¶r Weblate med Gunicorn under NGINX-webbservern (finns Ã¤ven som :file:`weblate/examples/weblate.nginx.gunicorn.conf`):

source: Sample configuration for NGINX and uWSGI
sv: Exempelkonfiguration fÃ¶r NGINX och uWSGI

source: To run production webserver, use the WSGI wrapper installed with Weblate (in virtual env case it is installed as :file:`~/weblate-env/lib/python3.9/site-packages/weblate/wsgi.py`). Don't forget to set the Python search path to your virtualenv as well (for example using ``virtualenv = /home/user/weblate-env`` in uWSGI).
sv: FÃ¶r att kÃ¶ra produktionswebbservern, anvÃ¤nd WSGI-wrapper som installerats med Weblate (i virtuell miljÃ¶ Ã¤r den installerad som :file:`~/weblate-env/lib/python3.9/site-packages/weblate/wsgi.py`). GlÃ¶m inte att stÃ¤lla in Python-sÃ¶kvÃ¤gen till din virtualenv ocksÃ¥ (till exempel med ``virtualenv = /home/user/weblate-env`` i uWSGI).

source: The following configuration runs Weblate as uWSGI under the NGINX webserver.
sv: FÃ¶ljande konfiguration kÃ¶r Weblate som uWSGI under NGINX-webbservern.

source: Configuration for NGINX (also available as :file:`weblate/examples/weblate.nginx.conf`):
sv: Konfiguration fÃ¶r NGINX (finns Ã¤ven som :file:`weblate/examples/weblate.nginx.conf`):

source: Configuration for uWSGI (also available as :file:`weblate/examples/weblate.uwsgi.ini`):
sv: Konfiguration fÃ¶r uWSGI (finns Ã¤ven som :file:`weblate/examples/weblate.uwsgi.ini`):

source: Sample configuration for Apache
sv: Exempel pÃ¥ konfiguration fÃ¶r Apache

source: It is recommended to use prefork MPM when using WSGI with Weblate.
sv: Det rekommenderas att anvÃ¤nda prefork MPM nÃ¤r du anvÃ¤nder WSGI med Weblate.

source: The following configuration runs Weblate as WSGI, you need to have enabled ``mod_wsgi`` (available as :file:`weblate/examples/apache.conf`):
sv: FÃ¶ljande konfiguration kÃ¶r Weblate som WSGI. Du mÃ¥ste ha aktiverat ``mod_wsgi`` (finns som :file:`weblate/examples/apache.conf`):

source: Weblate requires Python 3, so please ensure you are running Python 3 variant of the modwsgi. Usually it is available as a separate package, for example ``libapache2-mod-wsgi-py3``.
sv: Weblate krÃ¤ver Python 3, sÃ¥ se till att du kÃ¶r Python 3-varianten av modwsgi. Vanligtvis finns den tillgÃ¤nglig som ett separat paket, till exempel ``libapache2-mod-wsgi-py3``.

source: Use matching Python version to install Weblate.
sv: AnvÃ¤nd motsvarande Python-version fÃ¶r att installera Weblate.

source: Sample configuration for Apache and Gunicorn
sv: Exempelkonfiguration fÃ¶r Apache och Gunicorn

source: The following configuration runs Weblate in Gunicorn and Apache 2.4 (available as :file:`weblate/examples/apache.gunicorn.conf`):
sv: FÃ¶ljande konfiguration kÃ¶r Weblate i Gunicorn och Apache 2.4 (tillgÃ¤nglig som :file:`weblate/examples/apache.gunicorn.conf`):

source: Sample configuration to start Granian
sv: Exempel pÃ¥ konfiguration fÃ¶r att starta Granian

source: Weblate has `wsgi` optional dependency (see :ref:`python-deps`) that will install everything you need to run Granian. When installing Weblate you can specify it as:
sv: Weblate har `wsgi` som valfri beroende (se :ref:`python-deps`) som installerar allt du behÃ¶ver fÃ¶r att kÃ¶ra Granian. NÃ¤r du installerar Weblate kan du ange det som:

source: Once you have Granian installed, you can run it. This is usually done at the system level. The following examples show starting via systemd:
sv: NÃ¤r du har installerat Granian kan du kÃ¶ra det. Detta gÃ¶rs vanligtvis pÃ¥ systemnivÃ¥. FÃ¶ljande exempel visar hur man startar via systemd:

source: Sample configuration to start Gunicorn
sv: Exempelkonfiguration fÃ¶r att starta Gunicorn

source: Gunicorn has to be installed separately:
sv: Gunicorn mÃ¥ste installeras separat:

source: Once you have Gunicorn installed, you can run it. This is usually done at the system level. The following examples show starting via systemd:
sv: NÃ¤r du har installerat Gunicorn kan du kÃ¶ra det. Detta gÃ¶rs vanligtvis pÃ¥ systemnivÃ¥. FÃ¶ljande exempel visar hur man startar via systemd:

source: Running Weblate under path
sv: KÃ¶r Weblate under sÃ¶kvÃ¤gen

source: A sample Apache configuration to serve Weblate under ``/weblate``. Again using ``mod_wsgi`` (also available as :file:`weblate/examples/apache-path.conf`):
sv: Ett exempel pÃ¥ Apache-konfiguration fÃ¶r att kÃ¶ra Weblate under ``/weblate``. Ã terigen med hjÃ¤lp av ``mod_wsgi`` (finns Ã¤ven som :file:`weblate/examples/apache-path.conf`):

source: Additionally, you will have to adjust :file:`weblate/settings.py`:
sv: Dessutom mÃ¥ste du justera :file:`weblate/settings.py`:

source: Background tasks using Celery
sv: Bakgrundsuppgifter med Celery

source: Weblate uses Celery to execute regular and background tasks. You are supposed to run a Celery service that will execute these. For example, it is responsible for handling following operations (this list is not complete):
sv: Weblate anvÃ¤nder Celery fÃ¶r att utfÃ¶ra regelbundna uppgifter och bakgrundsuppgifter. Du ska kÃ¶ra en Celery-tjÃ¤nst som utfÃ¶r dessa uppgifter. Den ansvarar till exempel fÃ¶r fÃ¶ljande operationer (listan Ã¤r inte fullstÃ¤ndig):

source: Receiving webhooks from external services (see :ref:`hooks`).
sv: Ta emot webhooks frÃ¥n externa tjÃ¤nster (se :ref:`hooks`).

source: Running regular maintenance tasks such as backups, cleanups, daily add-ons, or updates (see :ref:`backup`, :setting:`BACKGROUND_TASKS`, :ref:`addons`).
sv: UtfÃ¶ra regelbundna underhÃ¥llsuppgifter sÃ¥som sÃ¤kerhetskopiering, rensning, dagliga tillÃ¤gg eller uppdateringar (se :ref:`backup`, :setting:`BACKGROUND_TASKS`, :ref:`addons`).

source: Running :ref:`auto-translation`.
sv: KÃ¶r :ref:`auto-translation`.

source: Sending digest notifications.
sv: Skicka sammanfattande meddelanden.

source: Offloading expensive operations from the WSGI process.
sv: Avlasta dyra operationer frÃ¥n WSGI-processen.

source: Committing pending changes (see :ref:`lazy-commit`).
sv: BekrÃ¤fta vÃ¤ntande Ã¤ndringar (se :ref:`lazy-commit`).

source: A typical setup using Valkey or Redis as a backend looks like this:
sv: En typisk konfiguration med Valkey eller Redis som backend ser ut sÃ¥ hÃ¤r:

source: :ref:`Redis broker configuration in Celery <celery:broker-redis-configuration>`
sv: :ref:`Redis-mÃ¤klarens konfiguration i Celery <celery:broker-redis-configuration>`

source: You should also start the Celery worker to process the tasks and start scheduled tasks, this can be done directly on the command-line (which is mostly useful when debugging or developing):
sv: Du bÃ¶r ocksÃ¥ starta Celery-arbetaren fÃ¶r att bearbeta uppgifterna och starta schemalagda uppgifter. Detta kan gÃ¶ras direkt pÃ¥ kommandoraden (vilket oftast Ã¤r anvÃ¤ndbart vid felsÃ¶kning eller utveckling):
